export const swar: Record<string, string> = {
  "अ": "x", "आ": "xa", "इ": "_i", "ई": "_i",
  "उ": "_u", "ऊ": "_u", "ऋ": "ri", "ए": "e",
  "ऐ": "e", "ओ": "o", "औ": "ou", "अं": "xN", "अः": "x",
};

export const vyanjan: Record<string, string> = { //ढ़
  "क": "k", "ख": "K", "ग": "g", "घ": "G", "ङ": "R", "ढ़": "R",
  "च": "c", "छ": "C", "ज": "z", "झ": "Z", "ञ": "n",
  "ट": "t", "ठ": "T", "ड": "d", "ढ": "D", "ण": "n",
  "त": "j", "थ": "J", "द": "q", "ध": "Q", "न": "n",
  "प": "p", "फ": "f", "ब": "b", "भ": "B", "म": "m",
  "य": "y", "र": "r", "ल": "l", "व": "w", "श": "S",
  "ष": "s", "स": "s", "ह": "v",
  "क्ष": "S", "त्र": "jr", "ज्ञ": "gy",
};

export const matra: Record<string, string> = {
  "ा": "a", "ि": "i", "ी": "i", "ु": "u", "ू": "u",
  "ृ": "ri", "े": "e", "ै": "xi", "ो": "o", "ौ": "ou",
  "ं": "N", "ः": "x", "ँ": "",
};

